nikhildevshatwar/k3-respart-tool/data/initial.syscfg
resourceAssignments7.$name  =  'modules_resourceAssignments7' ;
resourceAssignments7.devname  = 'J721E_DEV_R5FSS0_INTROUTER0' ;
resourceAssignments7.devId   = 134;
resourceAssignments7.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments7.subtypeid  =  0;
resourceAssignments7.resourcerangestart =  0;
resourceAssignments7.resourcecount = 256;






resourceAssignments8.$name  =  'modules_resourceAssignments8' ;
resourceAssignments8.devname  = 'J721E_DEV_R5FSS1_INTROUTER0' ;
resourceAssignments8.devId   = 135;
resourceAssignments8.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments8.subtypeid  =  0;
resourceAssignments8.resourcerangestart =  0;
resourceAssignments8.resourcecount = 256;






resourceAssignments9.$name  =  'modules_resourceAssignments9' ;
resourceAssignments9.devname  = 'J721E_DEV_TIMESYNC_INTRTR0' ;
resourceAssignments9.devId   = 136;
resourceAssignments9.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments9.subtypeid  =  0;
resourceAssignments9.resourcerangestart =  0;
resourceAssignments9.resourcecount = 48;






resourceAssignments10.$name  =  'modules_resourceAssignments10' ;
resourceAssignments10.devname  = 'J721E_DEV_WKUP_GPIOMUX_INTRTR0' ;
resourceAssignments10.devId   = 137;
resourceAssignments10.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments10.subtypeid  =  0;
resourceAssignments10.resourcerangestart =  0;
resourceAssignments10.resourcecount = 32;






resourceAssignments11.$name  =  'modules_resourceAssignments11' ;
resourceAssignments11.devname  = 'J721E_DEV_NAVSS0_MODSS_INTAGGR_0' ;
resourceAssignments11.devId   = 207;
resourceAssignments11.subtype   = 'RESASG_SUBTYPE_IA_VINT' ;
resourceAssignments11.subtypeid  =  10;
resourceAssignments11.resourcerangestart =  0;
resourceAssignments11.resourcecount = 64;






resourceAssignments12.$name  =  'modules_resourceAssignments12' ;
resourceAssignments12.devname  = 'J721E_DEV_NAVSS0_MODSS_INTAGGR_0' ;
resourceAssignments12.devId   = 207;
resourceAssignments12.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_SEVT' ;
resourceAssignments12.subtypeid  =  13;
resourceAssignments12.resourcerangestart =  20480;
resourceAssignments12.resourcecount = 1024;






resourceAssignments13.$name  =  'modules_resourceAssignments13' ;
resourceAssignments13.devname  = 'J721E_DEV_NAVSS0_MODSS_INTAGGR_1' ;
resourceAssignments13.devId   = 208;
resourceAssignments13.subtype   = 'RESASG_SUBTYPE_IA_VINT' ;
resourceAssignments13.subtypeid  =  10;
resourceAssignments13.resourcerangestart =  0;
resourceAssignments13.resourcecount = 64;






resourceAssignments14.$name  =  'modules_resourceAssignments14' ;
resourceAssignments14.devname  = 'J721E_DEV_NAVSS0_MODSS_INTAGGR_1' ;
resourceAssignments14.devId   = 208;
resourceAssignments14.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_SEVT' ;
resourceAssignments14.subtypeid  =  13;
resourceAssignments14.resourcerangestart =  22528;
resourceAssignments14.resourcecount = 1024;






resourceAssignments15.$name  =  'modules_resourceAssignments15' ;
resourceAssignments15.devname  = 'J721E_DEV_NAVSS0_UDMASS_INTAGGR_0' ;
resourceAssignments15.devId   = 209;
resourceAssignments15.subtype   = 'RESASG_SUBTYPE_IA_VINT' ;
resourceAssignments15.subtypeid  =  10;
resourceAssignments15.resourcerangestart =  38;
resourceAssignments15.resourcecount = 218;






resourceAssignments16.$name  =  'modules_resourceAssignments16' ;
resourceAssignments16.devname  = 'J721E_DEV_NAVSS0_UDMASS_INTAGGR_0' ;
resourceAssignments16.devId   = 209;
resourceAssignments16.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_SEVT' ;
resourceAssignments16.subtypeid  =  13;
resourceAssignments16.resourcerangestart =  38;
resourceAssignments16.resourcecount = 4570;






resourceAssignments17.$name  =  'modules_resourceAssignments17' ;
resourceAssignments17.devname  = 'J721E_DEV_NAVSS0_PROXY_0' ;
resourceAssignments17.devId   = 210;
resourceAssignments17.subtype   = 'RESASG_SUBTYPE_PROXY_PROXIES' ;
resourceAssignments17.subtypeid  =  0;
resourceAssignments17.resourcerangestart =  0;
resourceAssignments17.resourcecount = 64;






resourceAssignments18.$name  =  'modules_resourceAssignments18' ;
resourceAssignments18.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments18.devId   = 211;
resourceAssignments18.subtype   = 'RESASG_SUBTYPE_RA_ERROR_OES' ;
resourceAssignments18.subtypeid  =  0;
resourceAssignments18.resourcerangestart =  0;
resourceAssignments18.resourcecount = 1;






resourceAssignments19.$name  =  'modules_resourceAssignments19' ;
resourceAssignments19.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments19.devId   = 211;
resourceAssignments19.subtype   = 'RESASG_SUBTYPE_RA_GP' ;
resourceAssignments19.subtypeid  =  1;
resourceAssignments19.resourcerangestart =  440;
resourceAssignments19.resourcecount = 534;






resourceAssignments20.$name  =  'modules_resourceAssignments20' ;
resourceAssignments20.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments20.devId   = 211;
resourceAssignments20.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX' ;
resourceAssignments20.subtypeid  =  2;
resourceAssignments20.resourcerangestart =  316;
resourceAssignments20.resourcecount = 124;






resourceAssignments21.$name  =  'modules_resourceAssignments21' ;
resourceAssignments21.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments21.devId   = 211;
resourceAssignments21.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX' ;
resourceAssignments21.subtypeid  =  3;
resourceAssignments21.resourcerangestart =  16;
resourceAssignments21.resourcecount = 124;






resourceAssignments22.$name  =  'modules_resourceAssignments22' ;
resourceAssignments22.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments22.devId   = 211;
resourceAssignments22.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_TX_EXT' ;
resourceAssignments22.subtypeid  =  4;
resourceAssignments22.resourcerangestart =  140;
resourceAssignments22.resourcecount = 160;






resourceAssignments23.$name  =  'modules_resourceAssignments23' ;
resourceAssignments23.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments23.devId   = 211;
resourceAssignments23.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX_H' ;
resourceAssignments23.subtypeid  =  5;
resourceAssignments23.resourcerangestart =  304;
resourceAssignments23.resourcecount = 12;






resourceAssignments24.$name  =  'modules_resourceAssignments24' ;
resourceAssignments24.devname  = 'J721E_DEV_NAVSS0_RINGACC_0' ;
resourceAssignments24.devId   = 211;
resourceAssignments24.subtype   = 'RESASG_SUBTYPE_RA_UDMAP_RX_UH' ;
resourceAssignments24.subtypeid  =  6;
resourceAssignments24.resourcerangestart =  300;
resourceAssignments24.resourcecount = 4;






