nikhildevshatwar/k3-respart-tool/data/initial.syscfg
resourceAssignments59.$name  =  'modules_resourceAssignments59' ;
resourceAssignments59.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments59.devId   = 236;
resourceAssignments59.subtype   = 'RESASG_SUBTYPE_UDMAP_INVALID_FLOW_OES' ;
resourceAssignments59.subtypeid  =  1;
resourceAssignments59.resourcerangestart =  0;
resourceAssignments59.resourcecount = 1;






resourceAssignments60.$name  =  'modules_resourceAssignments60' ;
resourceAssignments60.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments60.devId   = 236;
resourceAssignments60.subtype   = 'RESASG_SUBTYPE_GLOBAL_EVENT_TRIGGER' ;
resourceAssignments60.subtypeid  =  2;
resourceAssignments60.resourcerangestart =  56320;
resourceAssignments60.resourcecount = 256;






resourceAssignments61.$name  =  'modules_resourceAssignments61' ;
resourceAssignments61.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments61.devId   = 236;
resourceAssignments61.subtype   = 'RESASG_SUBTYPE_UDMAP_GLOBAL_CONFIG' ;
resourceAssignments61.subtypeid  =  3;
resourceAssignments61.resourcerangestart =  0;
resourceAssignments61.resourcecount = 1;






resourceAssignments62.$name  =  'modules_resourceAssignments62' ;
resourceAssignments62.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments62.devId   = 236;
resourceAssignments62.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_CHAN' ;
resourceAssignments62.subtypeid  =  10;
resourceAssignments62.resourcerangestart =  2;
resourceAssignments62.resourcecount = 43;






resourceAssignments63.$name  =  'modules_resourceAssignments63' ;
resourceAssignments63.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments63.devId   = 236;
resourceAssignments63.subtype   = 'RESASG_SUBTYPE_UDMAP_RX_HCHAN' ;
resourceAssignments63.subtypeid  =  11;
resourceAssignments63.resourcerangestart =  0;
resourceAssignments63.resourcecount = 2;






resourceAssignments64.$name  =  'modules_resourceAssignments64' ;
resourceAssignments64.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments64.devId   = 236;
resourceAssignments64.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_CHAN' ;
resourceAssignments64.subtypeid  =  13;
resourceAssignments64.resourcerangestart =  2;
resourceAssignments64.resourcecount = 44;






resourceAssignments65.$name  =  'modules_resourceAssignments65' ;
resourceAssignments65.devname  = 'J721E_DEV_MCU_NAVSS0_UDMAP_0' ;
resourceAssignments65.devId   = 236;
resourceAssignments65.subtype   = 'RESASG_SUBTYPE_UDMAP_TX_HCHAN' ;
resourceAssignments65.subtypeid  =  15;
resourceAssignments65.resourcerangestart =  0;
resourceAssignments65.resourcecount = 2;






resourceAssignments66.$name  =  'modules_resourceAssignments66' ;
resourceAssignments66.devname  = 'J721E_DEV_MCU_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments66.devId   = 237;
resourceAssignments66.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments66.subtypeid  =  0;
resourceAssignments66.resourcerangestart =  4;
resourceAssignments66.resourcecount = 28;






resourceAssignments67.$name  =  'modules_resourceAssignments67' ;
resourceAssignments67.devname  = 'J721E_DEV_MCU_NAVSS0_INTR_ROUTER_0' ;
resourceAssignments67.devId   = 237;
resourceAssignments67.subtype   = 'RESASG_SUBTYPE_IR_OUTPUT' ;
resourceAssignments67.subtypeid  =  237;
resourceAssignments67.resourcerangestart =  36;
resourceAssignments67.resourcecount = 28;






